# SL_Import

## Description
Import Spotlight Data from xml file.

```pascal
PROCEDURE SL_Import(paramSelfHandle : HANDLE);
```

```python
def vs.SL_Import(paramSelfHandle):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|paramSelfHandle|HANDLE|   |

## Version
Availability: from Vectorworks 2011

## Category
* Spotlight